# frozen_string_literal: true

cask_args appdir: '/Applications'

tap 'homebrew/cask-versions'
tap 'telemachus/brew', 'https://telemachus@bitbucket.org/telemachus/brew.git', pin: true
tap 'heroku/brew'
tap 'homebrew/cask-drivers'
tap 'homebrew/cask-fonts'

cask 'font-fira-code'
brew 'bash'
brew 'wget'
brew 'tree'
brew 'imagemagick@6'
brew 'direnv'
brew 'git'
brew 'rename'
brew 'nodenv'
brew 'vim'
brew 'openssl'
brew 'mongodb'
brew 'postgresql'
brew 'redis'
brew 'sqlite'
brew 'tig'
brew 'readline'
brew 'heroku'
cask 'adoptopenjdk8'
brew 'elasticsearch'
brew 'direnv'

cask 'android-sdk'
cask 'android-studio'
cask 'android-platform-tools'
cask 'iterm2'
cask 'visual-studio-code'

cask 'appcleaner'
cask 'dropbox'
cask 'evernote'
cask 'google-chrome'
cask 'google-chrome-canary'
cask 'imagealpha'
cask 'imageoptim'
cask 'kindle'
cask 'skype'
cask 'spectacle'
cask 'textmate'
cask 'the-unarchiver'
cask 'transmission'
cask 'virtualbox'
cask 'vlc'
cask 'duckietv'
cask 'launchcontrol'
cask 'postman'
cask 'sony-ps4-remote-play'
cask 'whatsapp'
cask 'vlc'
cask 'teamviewer'
